{
    "2025-07-09": {
        "start_word": "rook",
        "end_word": "dust",
        "clue": "ruck",
        "message": "NMDOT’s comprehensive DUST mitigation strategy combines land restoration, technological detection, public alerts, and inter-agency enforcement. Through multi-phase habitat work, native seeding, monitoring systems, and strategic closures, they’ve significantly reduced dust events and improved safety along I‑10. Learn more about the project at the link",
        "link": "https://dustmitigation.nmdotprojects.org/",
        "target_guess": "5"
    },
    "2025-07-13": {
        "start_word": "pity",
        "end_word": "life",
        "clue": "cite",
        "message": "New Mexico is addressing WildLIFE-vehicle collisions through the Wildlife Corridors Action Plan, finalized in 2022. The plan identifies priority sites for wildlife crossings, including overpasses, underpasses, and fencing, to enhance safety for both wildlife and drivers. Learn more at the link.",
        "link": "https://wildlifeactionplan.nmdotprojects.org/",
        "target_guess": "4"
    },
    "2025-07-14": {
        "start_word": "rose",
        "end_word": "pave",
        "clue": "love",
        "message": "NMDOT recently wrapped up a $5.6 million repaving and “road diet” along the 5.5-mile stretch of Date, Broadway, and Main Streets to help slow drivers down and make the area safer for people walking and biking. Click the link for more info",
        "link": "https://www.dot.nm.gov/t-or-c-road-diet/",
        "target_guess": "4"
    },
    "2025-07-15": {
        "start_word": "word",
        "end_word": "aero",
        "clue": "herd",
        "message": "The New Mexico Department of Transportation (NMDOT) Aviation Division is distributing $20 million to 11 regional airport projects across the state, with Los Alamos County Airport receiving $1.9 million. Learn more at the link.",
        "link": "https://aviationacrossamerica.org/news/2022/04/29/nmdot-distributes-20-million-to-regional-airports-including-1-9-million-to-los-alamos/",
        "target_guess": "5"
    },
    "2025-07-16": {
        "start_word": "past",
        "end_word": "dock",
        "clue": "lack",
        "message": "New Mexico is set to get around $38 million from the federal NEVI program (2022–2026) to build a fast-charging network along I‑25, I‑40, and I‑10 with charging DOCKS spaced about every 50 miles. Each charging spot must have at least four ultra-fast (150 kW) CCS chargers, open to all drivers, plus NMDOT will cover installation, upkeep, data monitoring, and planning efforts .",
        "link": "https://www.dot.nm.gov/electrifying-new-mexico/?ev=nevi",
        "target_guess": "5"
    },
    "2025-07-17": {
        "start_word": "plan",
        "end_word": "grow",
        "clue": "ploy",
        "message": "This NMDOT project is all about helping ecosystems grow, layering green infrastructure along rights‑of‑way to tackle stormwater, reduce erosion, and rebuild wildlife habitats. Find out more at the link.",
        "link": "https://www.dot.nm.gov/planning-research-multimodal-and-safety/planning-division/research-and-climate-bureau/",
        "target_guess": "5"
    },
    "2025-07-18": {
        "start_word": "leer",
        "end_word": "span",
        "clue": "seen",
        "message": "$71.25 million federal grant and a total $142 million budget, NMDOT will SPAN Nogal Canyon with two modern bridges on I‑25 to replace deteriorating structures and flatten approach grades. Click the link for more info",
        "link": "https://www.dot.nm.gov/blog/2024/07/30/new-mexico-awarded-71-million-grant-for-nogal-canyon-bridge-replacement-project/",
        "target_guess": "5"
    },
    "2025-07-19": {
        "start_word": "oden",
        "end_word": "exit",
        "clue": "edin",
        "message": "The NMDOT is undertaking a significant design-build project to improve the I-25 corridor in Albuquerque, from Comanche to Montgomery, by replacing aging infrastructure, enhancing safety for all users, and aiming to improve travel times before you EXIT the area. Find out more at the link",
        "link": "https://www.i25improved.com/",
        "target_guess": "4"
    },
    "2025-07-20": {
        "start_word": "leap",
        "end_word": "deer",
        "clue": "dead",
        "message": "NMDOT building a massive overpass, underpasses and fencing along a 17‑mile stretch of US 550 north of Cuba, nicknamed the “Valley of Death,” to keep DEER, elk, bears, and other wildlife from getting hit. It’s now in design mode with engineering finishing this year and construction gearing up for 2026. Read more about the project at the link",
        "link": "https://www.dot.nm.gov/projects/active-projects/us550wildlifeproject/",
        "target_guess": "5"
    },
    "2025-07-21": {
        "start_word": "heal",
        "end_word": "rail",
        "clue": "neil",
        "message": "Check out this page to explore upcoming special events you can take the RAIL Runner to, like live Shakespeare performances on the train or free youth/senior rides: Ride the Rail Runner to special events! Learn more and view the full list at the link:",
        "link": "https://www.riometro.org/185/Special-Events",
        "target_guess": "5"
    },
    "2025-07-22": {
        "start_word": "cart",
        "end_word": "ride",
        "clue": "bade",
        "message": "Check out this page to discover how the NMDOT Park & RIDE can make your weekday commute chill with express buses, bike racks, ADA access, and easy-peasy parking at no extra cost. Explore Park & Ride bus & shuttle service at the link! ",
        "link": "https://www.dot.nm.gov/travel-information/park-and-ride-bus-shuttle-service/",
        "target_guess": "6"
    },
    "2025-07-23": {
        "start_word": "lock",
        "end_word": "safe",
        "clue": "sank",
        "message": "NMDOT’s design‑build overhaul from Comanche to Montgomery is straightening out the sketchy “S‑Curve” on I‑25 by adding a southbound lane, rebuilt interchanges, barrier‑separated bike/pedestrian paths, and U‑turns to make it SAFE for drivers, walkers, and bikers. To learn more click the link.",
        "link": "https://www.i25scurve.com/",
        "target_guess": "5"
    },
    "2025-07-24": {
        "start_word": "grad",
        "end_word": "flow",
        "clue": "clad",
        "message": "NMDOT is studying the U.S. 60 stretch from Milepost 136.2–139 through Socorro to determine upgrades that’ll boost safety, ease congestion, and improve pedestrian and bike access. Hoping to make the corridor FLOW better for locals and travelers alike by smoothing transitions between rural and urban zones. Learn more at the link.",
        "link": "https://www.dot.nm.gov/projects/active-projects/us60socorrostudy/",
        "target_guess": "5"
    },
    "2025-07-25": {
        "start_word": "zoom",
        "end_word": "tour",
        "clue": "poor",
        "message": "New Mexico invites travelers on a cultural TOUR through its landscapes blending Native American and Spanish heritage with arts, cuisine, festivals and outdoor exploration. It’s your one‑stop guide for planning scenic road trips, art and food tours, historic sites, and regional experiences across the Land of Enchantment. Learn more at the link.",
        "link": "https://www.newmexico.org/",
        "target_guess": "5"
    },
    "2025-07-26": {
        "start_word": "bond",
        "end_word": "road",
        "clue": "bead",
        "message": "The official ROAD advisory system from the New Mexico Department of Transportation that provides real-time updates on road conditions, closures, accidents, and weather via an interactive map and live cameras. Find out more at the link.",
        "link": "https://nmroads.com/default.html?",
        "target_guess": "4"
    },
    "2025-07-27": {
        "start_word": "warm",
        "end_word": "road",
        "clue": "lord",
        "message": "NMDOT is working on design improvements for Cerrillos ROAD, a busy four-lane corridor important for cars, bikes, pedestrians, and transit in Santa Fe. The project aims to improve mobility, fix sidewalks and drainage issues, and better manage traffic without adding more lanes or impacting nearby businesses and historic sites. Learn more about the project at the link",
        "link": "https://nm14cerrillos.nmdotprojects.org/",
        "target_guess": "5"
    },
    "2025-07-28": {
        "start_word": "seed",
        "end_word": "grid",
        "clue": "brad",
        "message": "NMDOT received grant to improve the EV charging GRID including new stations along I‑10. Plus, the state’s Clean Car Tax Credit offers up to $3,000 for new EVs (plus charger credits), making it easier for folks to go electric. Learn more about the project at the link",
        "link": "https://clean.energy.nm.gov/landing/clean-car/",
        "target_guess": "6"
    },
    "2025-07-29": {
        "start_word": "bose",
        "end_word": "root",
        "clue": "hoot",
        "message": "NMDOT is mapping, monitoring, and targeted treatments to nurture deep native roots and promote resilient roadside ecosystems across roughly 215,000 acres. Learn more about the project at the link",
        "link": "https://www.dot.nm.gov/infrastructure/environment/roadside-community-design-section/integrated-vegetation-management",
        "target_guess": "5"
    },
    "2025-07-30": {
        "start_word": "luke",
        "end_word": "ways",
        "clue": "ware",
        "message": "The New Mexico Scenic ByWAYS Story Map is a visually engaging guide to the state's most picturesque drives, from the alpine Enchanted Circle to the historic High Road to Taos. Learn more at the link, perfect for planning a road trip or simply daydreaming about your next adventure.",
        "link": "https://storymaps.arcgis.com/stories/03e6d455024b42129d9cb1ea087211b0",
        "target_guess": "5"
    },
    "2025-07-31": {
        "start_word": "site",
        "end_word": "past",
        "clue": "pitt",
        "message": "NMDOT’s Cultural Resources Section works to identify, protect, and preserve historic SITES from archaeological locations to Tribal cultural landscapes to ensure we honor the PAST as projects move forward. Learn how they balance highway improvements with heritage stewardship at the link.",
        "link": "https://www.dot.nm.gov/infrastructure/environment/cultural-resources-section/",
        "target_guess": "7"
    },
     "2025-08-01": {
        "start_word": "stag",
        "end_word": "plan",
        "clue": "slay",
        "message": "The Trail of the Ancients Scenic Byway, running through the Four Corners region, is getting refreshed corridor management and interactive mapping to spotlight archaeological sites, cultural history, and geologic wonders—bringing the ancient landscape to modern travelers. It’s all about making the journey as meaningful as the destination. Learn more at the link.",
        "link": "https://www.newmexico.org/places-to-visit/scenic-byways/trail-of-the-ancients/",
        "target_guess": "4"
    },
    "2025-08-02": {
        "start_word": "horn",
        "end_word": "mute",
        "clue": "core",
        "message": "NMDOT is establishing Quiet Zones along the Rail Runner route, allowing trains to pass crossings without sounding the HORN where safety upgrades are installed. Communities can apply to MUTE noise. Details at the link.",
        "link": "https://www.riometro.org/354/Pedestrian-and-Driver-Safety",
        "target_guess": "7"
    },
    "2025-08-03":{
        "start_word": "feel",
        "end_word": "glow",
        "clue": "flew",
        "message": "New street lighting is included as part of NMDOT’s major reconstruction along NM 31 and NM 128 near Jal, New Mexico. The upgrades aim to improve visibility, safety, and access for heavy truck traffic and residents, bringing a safer nighttime GLOW to this corridor. Learn more about the project at the link.",
        "link": "https://nm31-128project.nmdotprojects.org/",
        "target_guess": "5"
    },
    "2025-08-04": {
        "start_word": "flap",
        "end_word": "spin",
        "clue": "ship",
        "message": "NMDOT is studying options to improve the I‑25 Raton–Clayton interchange, where unclear ramps and poor sightlines have caused driver confusion and dangerous SPIN-outs. Public feedback is helping shape the future design. Learn more at the link.",
        "link": "https://bhi.mysocialpinpoint.com/raton-clayton-interchange",  
        "target_guess": "5"
    },
    "2025-08-05":{
        "start_word":"",
        "end_word":"",
        "clue":"",
        "message":"",
        "link":"",
        "target_guess":""
    },
    "2025-08-06": {
      "start_word": "gear",
      "end_word": "seek",
      "clue": "peak",
      "message": "Through NMDOT’s Tribal Consultation Portal, Tribal Nations can SEEK out planned projects statewide and see details via maps, surveys, and dashboards—empowering meaningful engagement. Learn more and provide input at the link.",
      "link": "https://tribal-consultation-portal-nmdot.hub.arcgis.com/",
      "target_guess": "5"
    },
    "2025-08-07": {
        "start_word": "luck",
        "end_word": "land",
        "clue": "bank",
        "message": "The City of Santa Fe replaced outdated quartz lights on Runway 2–20 with modern LED MIRL at Santa Fe Regional Airport, helping planes LAND safely even in fog. Learn about the design and fiber‑optic lighting controls at the link.",
        "link": "https://www.molzencorbin.com/portfolio/santa-fe-municipal-airport-runway-2-20-mirl-replacement/",
        "target_guess": "5"
    },
    "2025-08-08": {
        "start_word": "flow",
        "end_word": "draw",
        "clue": "brew",
        "message": "Local artist Roberto Lara painted “La Puesta del Sol” at Albuquerque’s Rail Yards, helping DRAW public attention to vibrant cultural storytelling along the Rail Trail. The new mural marks the beginning of an art corridor celebrating community identity—learn more at the link.",
        "link": "https://www.cabq.gov/artsculture/news/new-community-mural-kicks-off-public-art-along-the-rail-trail",
        "target_guess": "5"
    },
    "2025-08-09": {
        "start_word": "hour",
        "end_word": "plug",
        "clue": "slap",
        "message": "Las Cruces Public Schools installed 5 DC fast chargers and 7 Level II ports to PLUG in electric school bus fleets due to V2G pilot in New Mexico. These chargers are also available to the public during non-school hours. Learn more at the link.",
        "link": "https://nuvve.com/nuvve-launches-first-v2g-capable-electric-school-bus-deployment-in-new-mexico/",
        "target_guess": "8"
    },
    "2025-08-10": {
        "start_word": "kits",
        "end_word": "gear",
        "clue": "pets",
        "message": "NMDOT offers free winter-driving guidance, including ice and snow survival kits, chain installation tips, and how to access real-time road condition tools so drivers can get fully ready for winter. Learn all about preparing and staying safe during icy New Mexico weather at the link.",
        "link": "https://www.dot.nm.gov/winter-driving/",
        "target_guess": "7"
    }
}
